# Data Visualization

## Placholder Notebook

This notebook allows you to quickly start examining your data, expect it to change a lot over the course of the week.

### Postcode data

In [1]:
import pandas as pd

# The unlabelled postcode data
df1 = pd.read_csv('./flood_tool/resources/postcodes_unlabelled.csv')
df1.head()

,postcode,sector,easting,northing,localAuthority,altitude,soilType
0,BN1 5PF,BN1 5,530401.0,105619.0,Brighton and Hove,60,Unsurveyed/Urban
1,BN7 2HP,BN7 2,541934.0,110957.0,Lewes,10,Unsurveyed/Urban
2,TN6 3AW,TN6 3,552132.0,129270.0,Wealden,160,Unsurveyed/Urban
3,BN3 7LP,BN3 7,527448.0,106738.0,Brighton and Hove,60,Unsurveyed/Urban
4,DA16 2DU,DA16 2,546021.0,175403.0,Bexley,60,Unsurveyed/Urban

In [2]:
# The labelled postcode data

df2 = pd.read_csv('./flood_tool/resources/postcodes_sampled.csv')
df2.head()

,postcode,sector,easting,northing,localAuthority,altitude,soilType
0,PO7 8PR,PO7 8,469395.0,108803.0,Havant,30,Planosols
1,SO17 1NS,SO17 1,442771.0,114321.0,Southampton,20,Unsurveyed/Urban
2,TN28 8XN,TN28 8,606861.0,124689.0,Folkestone and Hythe,10,Cambisols
3,KT3 4JW,KT3 4,521649.0,168848.0,Kingston upon Thames,20,Unsurveyed/Urban
4,CT2 8AA,CT2 8,614532.0,158074.0,Canterbury,10,Unsurveyed/Urban

In [3]:
# The data on number of households

df3 = pd.read_csv('./flood_tool/resources/households_per_sector.csv')
df3.head()

  postcode sector  households  number of postcode units
0          AL1  1        2546                       311
1          AL1  2        2642                       236
2          AL1  3        2272                       388
3          AL1  4        3707                       339
4          AL1  5        4406                       347

In [4]:
# The data on measurement stations

df4 = pd.read_csv('./flood_tool/resources/stations.csv')
df4.tail()

,stationReference,stationName,latitude,longitude,maxOnRecord,minOnRecord,typicalRangeHigh,typicalRangeLow
2021,E71839,Portsmouth,50.802280,-1.111170,NaN,NaN,NaN,NaN
2022,E71939,Bournemouth,50.714331,-1.874873,NaN,NaN,NaN,NaN
2023,E70739,Aberdeen,57.144060,-2.077360,NaN,NaN,NaN,NaN
2024,E74239,Tobermory,56.623110,-6.064220,NaN,NaN,NaN,NaN
2025,E73339,Llandudno,53.331670,-3.825220,NaN,NaN,NaN,NaN

In [5]:
# The data for a wet day

df5 = pd.read_csv('./flood_tool/resources/wet_day.csv')
df5.head()

,dateTime,stationReference,parameter,qualifier,unitName,value
0,2021-05-07T00:00:00Z,000008,rainfall,Tipping Bucket Raingauge,mm,0.0
1,2021-05-07T00:00:00Z,000028,rainfall,Tipping Bucket Raingauge,mm,0.0
2,2021-05-07T00:00:00Z,000075TP,rainfall,Tipping Bucket Raingauge,mm,0.0
3,2021-05-07T00:00:00Z,000076TP,rainfall,Tipping Bucket Raingauge,mm,0.0
4,2021-05-07T00:00:00Z,0001,level,Tidal Level,mAOD,-0.551

In [6]:
# The data for a more typical day

df5 = pd.read_csv('./flood_tool/resources/typical_day.csv')
df5.head()

,dateTime,stationReference,parameter,qualifier,unitName,value
0,2021-10-10T00:00:00Z,000008,rainfall,Tipping Bucket Raingauge,mm,0.000
1,2021-10-10T00:00:00Z,000028,rainfall,Tipping Bucket Raingauge,mm,0.000
2,2021-10-10T00:00:00Z,000075TP,rainfall,Tipping Bucket Raingauge,mm,0.000
3,2021-10-10T00:00:00Z,000076TP,rainfall,Tipping Bucket Raingauge,mm,0.000
4,2021-10-10T00:00:00Z,0001,level,Tidal Level,mAOD,2.431

### Mapping your data

As one possible approach, we have provided a function to plot a circle on a map using the `folium` package. You can use `folium` and expand on this functionality, or you may prefer to use a different package. Please check with us that the mapping package you wish to use is permissible before you start.

In [7]:
import folium
import flood_tool
map = flood_tool.plot_circle(53., 0, 2000.) #Plots a circle of radius 2000 m at the lat, lon: 53., 0.

folium.Marker(location=(53, 0.1), 
                  popup='This is my popup',
                  icon=folium.Icon(color='black', icon='info-sign')).add_to(map)
map

ModuleNotFoundError: No module named 'folium'